app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @book = current_user.books.build
    @categories = Category.all.map{ |c| [c.name, c.id] } #to fetch all the categories

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]
    if @book.save

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "2nd Category"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  [["category_id", 1]]
---
  def index
  	if params[:category].blank?
    	@books = Book.all.order('created_at DESC')
    else
    	@category_id = Category.find_by(name: params[:category]).id
    	@books = Book.where(category_id: @category_id)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 5]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 5]]
---
  def show

    if @book.reviews.blank?
      @average_rating = 0
    else
      @average_rating = @book.reviews.average(:rating).round(2)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_books
    @book = Book.find(params[:id])