app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "Googd"], ["created_at", "2020-03-05 12:04:12.291006"], ["updated_at", "2020-03-05 12:04:12.291006"], ["user_id", 1], ["book_id", 5]]
---
	def create
		@review = Review.new(review_params)
		@review.book_id = @book.id
		@review.user_id = current_user.id

		if @review.save

UPDATE "reviews" SET "rating" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", nil], ["comment", "Good"], ["updated_at", "2020-03-05 12:04:24.348421"], ["id", 1]]
---
	def update
		if @review.update(review_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def find_book
		@book = Book.find(params[:book_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_reviews
		@review = Review.find(params[:id])